In [1]:
import pandas as pd

In [5]:
frame = pd.read_csv('data_sample_example.tsv', sep='\t', header=0)

In [6]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [7]:
type(frame)

pandas.core.frame.DataFrame

In [8]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [9]:
frame['Age'] = [29] * 5 + [28]

In [10]:
frame

              Name       Birth       City  Position  Age
0      Иванов А.А.  22.03.1980     Москва       NaN   29
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   29
2       Белов М.М.  13.02.1980     Ростов  менеджер   29
3  Мельникова Д.С.  15.04.1985     Ростов       NaN   29
4      Рыбина Е.П.  19.11.1985     Москва   инженер   29
5     Костров С.О.  31.05.1985     Москва    стажер   28

In [11]:
[2] * 5

[2, 2, 2, 2, 2]

In [12]:
type([2])

list

In [14]:
type((2, 3))

tuple

In [15]:
frame['Level'] = (2) * 6

In [16]:
frame

              Name       Birth       City  Position  Age  Level
0      Иванов А.А.  22.03.1980     Москва       NaN   29     12
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   29     12
2       Белов М.М.  13.02.1980     Ростов  менеджер   29     12
3  Мельникова Д.С.  15.04.1985     Ростов       NaN   29     12
4      Рыбина Е.П.  19.11.1985     Москва   инженер   29     12
5     Костров С.О.  31.05.1985     Москва    стажер   28     12